[
    {
        "_id": "57f451296941aad3596d1477",
        "title": "Personal Stuff",
        "highlights": [
            {
                "heading": "Home",
                "content": "I grew up in South Eastern Michigan about a 45 minute drive to both Detroit and Ann Arbor (I still measure most distances by the time it takes to drive). I still have a wonderful family that live in the same area and get back as often as I can."
            },
            {
                "heading": "College Part 1",
                "content": "While I Graduated from Eastern Michigan University in Ypsilanti with a degree in communications I took the long way getting there. Spending time first at Western Michigan University but my time here was cut short due to some pretty big academic mistakes I made in my first semester that I just couldn’t over come. I spent the next few years taking classes at a Kalamazoo Community College to get ready to transfer to a university. After weighing my options I ultimately decided to make the move to Eastern Michigan University (EMU) to avoid having to again fight my first semester mistakes and to be a little closer to my family."
            },
            {
                "heading": "College Part 2",
                "content": "Transferring to Eastern was so much better of a decision than I could have ever understood at the time. While there I became involved in a program called Alternative Breaks, first by spending my spring break helping build homes in rural West Virginia for a local non-profit. My trip to West Virginia was not just fulfilling but introduced me to community service, something that felt like the missing puzzle piece that finally made the puzzle of who I was make sense. I spent the remainder of my time at EMU working with the volunteer center; coordinating alternative breaks and providing communications support for the other programs offered though the office. My work there would bring me to work with BreakAway the national organization for Alternative Breaks Programs and Delta Tau Delta International Fraternity. My time with BreakAway cemented my commitment to life long service and active citizenship, by proving that you don't need to be Mother Theresa or Oprah to be active in your community. Joining Delta Tau Delta was a bit of a surprise, I was 25 and mostly done with school by that point, not your typical rush candidate. I found a group of people that I really connected with while attending a student leadership conference called LeaderShape, when that conference was over we stayed in contact through the summer. Since I had been spending quite a bit of time with their members, I wasn't exactly surprised when I received my pledge invitation. My experience as an active member of the fraternity really cemented some of my core values, like a commitment to ceremony, building family from those around you, honesty and community engagement."
            },
            {
                "heading": "AmeriCorps",
                "content": "After college, I was ready to get to work; unfortunately the 2008 economic crisis had better plans. After spending 9 months looking for work in South Eastern Michigan I was forced to start looking else where and for more than just a job. This lead me to AmeriCorps, a national service organization that places members at non-profit organizations to build capacity and serve directly with the community. While searching through their openings, I found an opportunity to teach computer skills to recently released felons in North Minneapolis, this brought together two of my strong passions, community service and technology. I was ecstatic when I was selected for this position and started making preparations to move to Minneapolis. My first year here I was able to develop a technology education program for a workforce center that dealt with basic computer skills, and the Microsoft Office Suite. In my second year with AmeriCorps I transitioned to a slightly different role, working with kids and their parents. In this position I was able to develop out a computer distribution program (which eventually came with free internet access, one of the first programs to do that) for middle and high school aged youth living in supportive housing and trainings on how to use these resources for schoolwork. This is still one of my greatest achievements."
            },
            {
                "heading": "College part 3",
                "content": "After AmeriCorps I spent the better part of the year looking for work in the nonprofit sector while working part time at Blockbuster and as a Job Coach for people with developmental disabilities. Working two part-time jobs turns out is a lot more difficult than it sounds, so when an opportunity to work at a Wells Fargo 401k call center came a knocking I opened the door about as fast as I could. The stability of a full-time job with benefits was very empowering, however the work was pretty mundane and repetitive which lead me to enroll in a local community college and start taking classes in software development. Now for the past 3 years, I have been working towards an Associates of Applied Science in Software Development, expecting to graduate by the end of 2017. During this time I have moved from my call center job at Wells Fargo into a Risk and Compliance roll focusing on the Wells Fargo Identity Theft Protection and then into my current role providing technical production support to a 15+ operations teams."
            },
            {
                "heading": "College part 4",
                "content": "I am currently exploring my options for after my AAS in Software Development has completed. I am wavering between a masters in Computer Science, Information Science, Software Development, or Business Administration. I still have a little bit of time before I have to finalize that decisions but I am sure that I am not done with school just yet."
            }
        ]
    },
    {
        "_id": "57f451296941aad3596d1478",
        "title": "Software Development",
        "highlights": [
            {
                "heading": "Classes",
                "content": "As stated above, I am currently a student at the Minneapolis Community and Technical College (MCTC) as part of their Associates of Applied Science program focusing on Software Development. This program takes a learn by doing approach to software development education. The first course in the program is taught in Python and covers the basic concepts in software development (data types, loops, boolean logic, functions, and classes) as a foundation for intermediate classes in languages of the student's choosing. I have chosen to study Visual Basic.NET, C#.NET and Apple's Swift programming language. In these classes students are tasked with building a applications of increasing complexity, almost always in groups. All of my group work has been aided by the use of Git as a version control system with Github and Slack being the primary collaboration tools."
            },
            {
                "heading": "Outside of Class",
                "content": "Since starting this program I have had a hard time not thinking about, learning about or actually developing software. I am constantly seeking out resources be it books, websites, podcasts, and/or [un]conferences. Some of the highlights include Books: Clean Code and the Pragmatic Programmer, Websites: Apple's Swift documentation and WWDC sessions for more information about Swift, I regularly just read code on GitHub, sometimes answering questions on StackOverflow, podcasts: I have enjoyed listening to episodes of NodeUp, Learn To Code With Me and Arrested DevOps, [Un]conferences: I have attended the Independent Game Developers Association meet up, Agile Development meet ups hosted by DevJam and Javascript meet ups and am always looking for more ways to get involved in the development community as a whole. I have a virtual Linux 14.04 LTS server that I manage; this server is where I host a few websites (including this one) and some REST APIs mostly written in the MEAN stack. Having access to a cloud server has be a great experience, it has given me a much greater understanding of how real software is designed to work and an appreciation of what technology operations really means."
            }
        ]
    }
]