[
    {
        "title": "Personal Stuff",
        "description": "Hello and welcome to my website. Thank you for taking the time out of your day to visit.",
        "highlights": [
            {
                "heading": "Home",
                "content": "I grew up in South Eastern Michigan about a 45 minute drive to both Detroit and Ann Arbor (I still measure most distances by the time it takes to drive). I still have a wonderful family that live in the same area and get back as often as I can."
            },
            {
                "heading": "College",
                "content": "While I Graduated from Eastern Michigan Universit in Ypsilanti with a degree in communications I did take a bit of a meandering path through college. Along the way I got involved in some really amazing programs that have had a huge impact on me. I was a radio DJ for WIDR-FM, which gave me some pretty rockstar dreams (and taste in music, I think). Later on in my career I started working with the Alternative Spring Break program where I helped to corrdinate volunteer trips for students across the Eastern United States. This was my first real work in the nonprofit/civic engagement space and really changed my life's direction. I am also an alumni member of Delta Tau Delta's Theta Xi chapter which re-enforced my core values."
            },
            {
                "heading": "AmeriCorps",
                "content": "After college, I was ready to get to work, unfortunatly the 2008 econimic crisis had better plans. I accepted a position as part of AmeriCorps' State and National program teaching computer skills to reciently released fellons for a year and then developing a computer and internet distribution program for middle school aged students. This really brought together two of my life long passions, Technology and non-profit organization."
            }, 
            {
                "heading": "College part 2",
                "content": "After spending a little time in the work-force, I decided that my desire for learning was not done.  Since then, I have been taking classes at a local community college in software development, I will be finishing up a post-bachloriate associates degree in the fall of 2017 and then hopefully on to graduate school."
            }
        ]
    },
    {
        "title": "Software Development",
        "description": "Since I started in on a software development associates degree, I have not been able to pry myself away from learning about software development and implementing those lessons",
        "highlights": [
            {
                "heading": "School Topics",
                "content": "My studies have taken me through the beginner to intermediate level of working with the following list of languages: Python, Visual Basic.Net, C#.Net, Swift and TSQL. While I tend to jump between languages."
            },
            {
                "heading": "The other stuff",
                "content": "Outside of these classes, I spend quite a bit of time studying software development concepts. Clean Code and the Pragmatic Programmer are great foundations to this additonal lerning, helping me to understand Object Oriented design and best practices in developing software. I have a virtual Linux 14.04 server that I manage, this server is where I host a few websites (including this one) and some REST APIs mostly written in the MEAN stack. Managing this server has been an amazing lesson in technology operations and the client server relationship."
            }
        ]
    }
]