[{"title":"Business System Consultant","employer":"Wells Fargo","start":"October 2015","end":"Current","bullets":["As an opportuninty to learn more about financial industry messaging standards and the applications that my deparment ueses to process them, I was asked to coordinat system integration and user acceptances testing as well as production validation for a suite of 7 applications undergoing quartly Java patches.","In our 2nd round of Java patch testing, I was frustrated with the 25+ hours it was taking me to create, correctly formatted and unique, trade files for each of the 25 tests I was performing.  I created an MS Access application that would gather the required information from TSQL and DB2 datasources and generate these for me, reducing the total time of my testing activites to under 4 hours.","A member of my team is required to check the health of one of the applications we support hourly and document this check by querying a TSQL database, reading a log file and performing a search in a web application.  I was able to create a Nodejs script that runs at the top of each hour to query the database and parse the text file in an effort to make this process more efficient","Three or more times a month, an MS Access database that is used as an application launcher becomes corrupted, even implementing daily corrective action to avoid this. I was able to create a working prototype of this using Nodejs, Express and Angular"],"collection":"jobs"},{"title":"Quality Monitor","employer":"Wells Fargo","start":"January 2014","end":"October 2015","bullets":["6 Months after starting in the role, my department was transition to another devision of the company, this meant that we lost a large number of resources; most importantly our Database Analyst. I was able to perform my normal duties as wells as provide technical support for a department of 10 using 4 inter-related shared MS Access applications","In an under resourced department, I was able to develop an MS Access solution for evaluating employee performance. My solution reduced the time spent on this task from 40 hours each month to less than 8 hours each month.","When a co-worker approached me about a morning load of data was taking as long as an hour, I was able to re-work the MS Access import query to reduce this to under a minute","After being the only source of technical support for 8 months for these applications, I created a set of documents and workflows to allow any member of my team to navigate common issues","I was trained over the course of 3 months to pull monthly reporting using a highly technical process. I developed a set of MS Access reports to pull this data quickly and efficently, allowing this task to be performed by almost anyone on my team."],"collection":"jobs"}]