[
    {
        "title": "Business System Consultant",
        "employer": "Wells Fargo",
        "start": "October 2015",
        "end": "Current",
        "bullets": [
            "As an opportunity to learn more about financial industry messaging standards and the applications that my department uses to process them, I was asked to coordinate and participate in system integration and user acceptances testing as well as production validation for a suite of 7 applications undergoing quarterly Java patches. I created an MS Access application that would gather the required information from SQL and DB2 data sources and generate trade files for me, reducing the total time of my testing activities from over 25 hours to less than 4 hours.",
            "My team is required to check the health of one of the applications we support each hour and document this check by querying a TSQL database, reading a log file and performing a search in a web application. To make this process more efficient I created a Nodejs script that runs at the top of each hour to query the database and parse the text file.", 
            "Three or more times a month, one of our application launchers becomes corrupted, even after implementing daily corrective action to avoid this. To address issues of a corrupt application launcher, I created a working prototype using Nodejs, Express and Angular. I am currently working on a version using GitHub's Electron platform to replaces the existing Access Database."

        ],
        "collection": "jobs"
    },
    {
        "title": "Quality Monitor",
        "employer": "Wells Fargo",
        "start": "January 2014",
        "end": "October 2015",
        "bullets": [
            "During a department transition, we lost our Database Analyst. I performed my normal duties, as well as technical support for a department of 10, using 4 inter-related shared MS Access applications.",
            "In an under resourced department, I was able to develop an MS Access solution for evaluating employee performance. My solution reduced the time spent on this task from 40 hours each month to less than 8 hours each month.",
            "My department’s data import process was taking as long as an hour each morning. I re-worked the MS Access import query to reduce this to under a minute.",
            "I was trained over the course of 3 months to pull monthly reporting using a highly technical process. I developed a set of MS Access reports to pull this data quickly and efficiently, allowing this task to be performed by almost anyone on my team.",
            "In preparation for a career transition, I created a set of documents and workflows to allow any member of my team to navigate common issues for the department’s Access databases."
        ],
        "collection": "jobs"
    }
]