[
    {
        "title": "MCTC Software Development Program",
        "employer": "Education",
        "start": "January 2014",
        "end": "Current",
        "bullets": [
            "My classes include a course in basic programming concepts taught in Python, practical application building in Visual Basic.NET and C#.NET for Windows and Swift for iOS, watchOS, tvOS and Linux; each one building on the last. By the end of my course in Swift I was able to build applications that use location data, Google Calendar, and Sign In APIs. I also built my own REST API (written in a beta version of Swift 3) that I hosted on a cloud server. My coursework will continue with a class in Transact SQL, Systems Design, and Agile Methodologies. My anticipated date of graduation is December 2017 with an Associates of Applied Science in Software Development.",
            "The program's main goal is to mimic the working environment as much as possible, with a focus on group work. Within this setting, I have used Git as a primary version control system and leverage tools like GitHub and Slack to collaborate with other students."

        ],
        "collection": "nonjobs"
    },
    {
        "title": "Personal Projects",
        "employer": "Miscelanous",
        "start": "2012",
        "end": "Forever",
        "bullets": [
            "In 2012, I began my programming work by discovering the book Learn Python the Hard Way. I moved on to Codecademy courses in Ruby, PHP, Python, HTML, CSS and Javascript and Angular. I determined that this was my passion and enrolled in a software development program at the local community college. Since then, I have spent most of my time learning and experiencing everything I can about the field.",
            "Over the past two years I have been managing my own Linux cloud server, and I have learned how much more versatile my applications are when I have a server side component. This has allowed me to continue working on developing my skills in writing NGINX configuration files, managing my server's security settings and trying to keep all of the pieces in place so that my services wouldn’t become unavailable."

        ],
        "collection": "nonjobs"
    }
]